<?xml version="1.0"?>
<net name="tokenizer" version="11">
	<layers>
		<layer id="0" name="Parameter_55075" type="Parameter" version="opset1">
			<data shape="?" element_type="string" />
			<output>
				<port id="0" precision="STRING" names="Parameter_55075">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_55173" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="2" name="Constant_55174" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="3" name="Constant_55175" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="8" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_55176" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="5" name="Constant_55177" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="6" name="Constant_55178" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="12" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_55081" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="16" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="8" name="StringTensorUnpack_55076" type="StringTensorUnpack" version="extension">
			<data mode="begins_ends" />
			<input>
				<port id="0" precision="STRING">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="ShapeOf_55077" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_55078" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="16" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="11" name="Constant_55079" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="16" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="12" name="Gather_55080" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" />
			</output>
		</layer>
		<layer id="13" name="Constant_55082" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="14" name="Range_55083" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_55084" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="16" name="Constant_55085" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="17" name="Add_55086" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" />
			</output>
		</layer>
		<layer id="18" name="Constant_55087" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="19" name="Range_55088" type="Range" version="opset4">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_55150" type="Const" version="opset1">
			<data element_type="u8" shape="26479" offset="32" size="26479" />
			<output>
				<port id="0" precision="U8">
					<dim>26479</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="SpecialTokensSplit_55151" type="SpecialTokensSplit" version="extension">
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="U8">
					<dim>26479</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="11" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_55153" type="Const" version="opset1">
			<data element_type="u8" shape="64" offset="26511" size="64" />
			<output>
				<port id="0" precision="U8">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="RegexSplit_55154" type="RegexSplit" version="extension">
			<data behaviour="isolate" invert="false" max_splits="-1" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="BOOL">
					<dim>-1</dim>
				</port>
				<port id="6" precision="U8">
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="11" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="12" precision="BOOL">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_55156" type="Const" version="opset1">
			<data element_type="u8" shape="528248" offset="26575" size="528248" />
			<output>
				<port id="0" precision="U8">
					<dim>528248</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StringTensorUnpack_55157" type="StringTensorUnpack" version="extension">
			<data mode="begins_ends" />
			<input>
				<port id="0" precision="U8">
					<dim>528248</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_55162" type="Const" version="opset1">
			<data element_type="u8" shape="369958" offset="554823" size="369958" />
			<output>
				<port id="0" precision="U8">
					<dim>369958</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StringTensorUnpack_55163" type="StringTensorUnpack" version="extension">
			<data mode="begins_ends" />
			<input>
				<port id="0" precision="U8">
					<dim>369958</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_55165" type="Const" version="opset1">
			<data element_type="u8" shape="336859" offset="924781" size="336859" />
			<output>
				<port id="0" precision="U8">
					<dim>336859</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StringTensorUnpack_55166" type="StringTensorUnpack" version="extension">
			<data mode="begins_ends" />
			<input>
				<port id="0" precision="U8">
					<dim>336859</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_55159" type="Const" version="opset1">
			<data element_type="u8" shape="20163" offset="1261640" size="20163" />
			<output>
				<port id="0" precision="U8">
					<dim>20163</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StringTensorUnpack_55160" type="StringTensorUnpack" version="extension">
			<data mode="begins_ends" />
			<input>
				<port id="0" precision="U8">
					<dim>20163</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="U8">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_55167" type="Const" version="opset1">
			<data element_type="i32" shape="1608" offset="1281803" size="6432" />
			<output>
				<port id="0" precision="I32">
					<dim>1608</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="BPETokenizer_55168" type="BPETokenizer" version="extension">
			<data unk_token="" fuse_unk="false" suffix_indicator="" end_suffix="" byte_fallback="false" cache_capacity="20000" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="4" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="10" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="11" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="12" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="13" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="14" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="15" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="16" precision="U8">
					<dim>-1</dim>
				</port>
				<port id="17" precision="I32">
					<dim>1608</dim>
				</port>
			</input>
			<output>
				<port id="18" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="19" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="20" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Subtract_55169" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_55170" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="1288235" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="36" name="Minimum_55171" type="Minimum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Add_55172" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_55179" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="39" name="Constant_55180" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="4" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="40" name="Constant_55181" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="1288239" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_55182" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="1288243" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="CombineSegments_55183" type="CombineSegments" version="extension">
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32" />
				<port id="4" precision="I32" />
				<port id="5" precision="I32">
					<dim>1</dim>
				</port>
				<port id="6" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="7" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="8" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="9" precision="I32" />
				<port id="10" precision="I32" />
				<port id="11" precision="I32">
					<dim>1</dim>
				</port>
				<port id="12" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="13" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="14" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="15" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="16" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="17" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="18" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Subtract_55184" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_55185" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="45" name="ReduceMax_55186" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" />
			</output>
		</layer>
		<layer id="46" name="Constant_55187" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="1288239" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="47" name="RaggedToDense_55188" type="RaggedToDense" version="extension">
			<data pad_right="true" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32" />
				<port id="4" precision="I32" />
			</input>
			<output>
				<port id="5" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="6" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Convert_55189" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Convert_55189" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="RaggedToDense_55188.0" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Result_55192" type="Result" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
		<layer id="50" name="Result_55194" type="Result" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="8" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="42" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="42" to-port="1" />
		<edge from-layer="3" from-port="0" to-layer="42" to-port="2" />
		<edge from-layer="4" from-port="0" to-layer="42" to-port="3" />
		<edge from-layer="5" from-port="0" to-layer="42" to-port="4" />
		<edge from-layer="6" from-port="0" to-layer="42" to-port="5" />
		<edge from-layer="7" from-port="0" to-layer="14" to-port="0" />
		<edge from-layer="8" from-port="1" to-layer="9" to-port="0" />
		<edge from-layer="8" from-port="3" to-layer="21" to-port="4" />
		<edge from-layer="8" from-port="2" to-layer="21" to-port="3" />
		<edge from-layer="8" from-port="1" to-layer="21" to-port="2" />
		<edge from-layer="9" from-port="1" to-layer="12" to-port="0" />
		<edge from-layer="10" from-port="0" to-layer="12" to-port="1" />
		<edge from-layer="11" from-port="0" to-layer="12" to-port="2" />
		<edge from-layer="12" from-port="3" to-layer="14" to-port="1" />
		<edge from-layer="12" from-port="3" to-layer="17" to-port="0" />
		<edge from-layer="13" from-port="0" to-layer="14" to-port="2" />
		<edge from-layer="14" from-port="3" to-layer="21" to-port="0" />
		<edge from-layer="15" from-port="0" to-layer="19" to-port="0" />
		<edge from-layer="16" from-port="0" to-layer="17" to-port="1" />
		<edge from-layer="17" from-port="2" to-layer="19" to-port="1" />
		<edge from-layer="18" from-port="0" to-layer="19" to-port="2" />
		<edge from-layer="19" from-port="3" to-layer="21" to-port="1" />
		<edge from-layer="20" from-port="0" to-layer="21" to-port="5" />
		<edge from-layer="21" from-port="7" to-layer="23" to-port="1" />
		<edge from-layer="21" from-port="8" to-layer="23" to-port="2" />
		<edge from-layer="21" from-port="9" to-layer="23" to-port="3" />
		<edge from-layer="21" from-port="10" to-layer="23" to-port="4" />
		<edge from-layer="21" from-port="11" to-layer="23" to-port="5" />
		<edge from-layer="21" from-port="6" to-layer="23" to-port="0" />
		<edge from-layer="22" from-port="0" to-layer="23" to-port="6" />
		<edge from-layer="23" from-port="7" to-layer="33" to-port="0" />
		<edge from-layer="23" from-port="11" to-layer="33" to-port="4" />
		<edge from-layer="23" from-port="10" to-layer="33" to-port="3" />
		<edge from-layer="23" from-port="9" to-layer="33" to-port="2" />
		<edge from-layer="23" from-port="8" to-layer="33" to-port="1" />
		<edge from-layer="24" from-port="0" to-layer="25" to-port="0" />
		<edge from-layer="25" from-port="1" to-layer="33" to-port="5" />
		<edge from-layer="25" from-port="2" to-layer="33" to-port="6" />
		<edge from-layer="25" from-port="3" to-layer="33" to-port="7" />
		<edge from-layer="26" from-port="0" to-layer="27" to-port="0" />
		<edge from-layer="27" from-port="3" to-layer="33" to-port="10" />
		<edge from-layer="27" from-port="1" to-layer="33" to-port="8" />
		<edge from-layer="27" from-port="2" to-layer="33" to-port="9" />
		<edge from-layer="28" from-port="0" to-layer="29" to-port="0" />
		<edge from-layer="29" from-port="3" to-layer="33" to-port="13" />
		<edge from-layer="29" from-port="2" to-layer="33" to-port="12" />
		<edge from-layer="29" from-port="1" to-layer="33" to-port="11" />
		<edge from-layer="30" from-port="0" to-layer="31" to-port="0" />
		<edge from-layer="31" from-port="1" to-layer="33" to-port="14" />
		<edge from-layer="31" from-port="2" to-layer="33" to-port="15" />
		<edge from-layer="31" from-port="3" to-layer="33" to-port="16" />
		<edge from-layer="32" from-port="0" to-layer="33" to-port="17" />
		<edge from-layer="33" from-port="20" to-layer="42" to-port="8" />
		<edge from-layer="33" from-port="18" to-layer="42" to-port="6" />
		<edge from-layer="33" from-port="18" to-layer="37" to-port="0" />
		<edge from-layer="33" from-port="18" to-layer="34" to-port="1" />
		<edge from-layer="33" from-port="19" to-layer="34" to-port="0" />
		<edge from-layer="34" from-port="2" to-layer="36" to-port="0" />
		<edge from-layer="35" from-port="0" to-layer="36" to-port="1" />
		<edge from-layer="36" from-port="2" to-layer="37" to-port="1" />
		<edge from-layer="37" from-port="2" to-layer="42" to-port="7" />
		<edge from-layer="38" from-port="0" to-layer="42" to-port="9" />
		<edge from-layer="39" from-port="0" to-layer="42" to-port="10" />
		<edge from-layer="40" from-port="0" to-layer="42" to-port="11" />
		<edge from-layer="41" from-port="0" to-layer="42" to-port="12" />
		<edge from-layer="42" from-port="13" to-layer="43" to-port="1" />
		<edge from-layer="42" from-port="15" to-layer="47" to-port="2" />
		<edge from-layer="42" from-port="14" to-layer="47" to-port="1" />
		<edge from-layer="42" from-port="13" to-layer="47" to-port="0" />
		<edge from-layer="42" from-port="14" to-layer="43" to-port="0" />
		<edge from-layer="43" from-port="2" to-layer="45" to-port="0" />
		<edge from-layer="44" from-port="0" to-layer="45" to-port="1" />
		<edge from-layer="45" from-port="2" to-layer="47" to-port="3" />
		<edge from-layer="46" from-port="0" to-layer="47" to-port="4" />
		<edge from-layer="47" from-port="6" to-layer="48" to-port="0" />
		<edge from-layer="47" from-port="5" to-layer="51" to-port="0" />
		<edge from-layer="48" from-port="1" to-layer="49" to-port="0" />
		<edge from-layer="49" from-port="1" to-layer="50" to-port="0" />
		<edge from-layer="51" from-port="1" to-layer="52" to-port="0" />
	</edges>
	<rt_info>
		<add_attention_mask value="True" />
		<add_prefix_space />
		<add_special_tokens value="True" />
		<bos_token_id value="50257" />
		<clean_up_tokenization_spaces />
		<detokenizer_input_type value="i64" />
		<eos_token_id value="50257" />
		<handle_special_tokens_with_re />
		<number_of_inputs value="1" />
		<openvino_tokenizers_version value="2024.6.0.0" />
		<openvino_version value="2024.6.0" />
		<original_tokenizer_class value="&lt;class 'transformers.models.whisper.tokenization_whisper_fast.WhisperTokenizerFast'>" />
		<pad_token_id value="50257" />
		<sentencepiece_version value="0.2.0" />
		<skip_special_tokens value="True" />
		<streaming_detokenizer value="False" />
		<tokenizer_output_type value="i64" />
		<tokenizers_version value="0.20.3" />
		<transformers_version value="4.46.3" />
		<use_max_padding value="False" />
		<use_sentencepiece_backend value="False" />
		<utf8_replace_mode value="replace" />
		<with_detokenizer value="True" />
	</rt_info>
</net>
